PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc2378/lpc23xx_serial.c
};

static uart_dev_t g_uart2port =
{
  .recv =
    {
      .size = CONFIG_UART2_RXBUFSIZE,
      .buffer = g_uart2rxbuffer,
    },
  .xmit =
    {
      .size = CONFIG_UART2_TXBUFSIZE,
      .buffer = g_uart2txbuffer,
    },
  .ops  = &g_uart_ops,
  .priv = &g_uart2priv,
};

#endif

/* Now, which one with be tty0/console and which tty1? */

#if defined(CONFIG_UART0_SERIAL_CONSOLE)
#  define CONSOLE_DEV     g_uart0port
#  define TTYS0_DEV       g_uart0port
#  define TTYS1_DEV       g_uart2port
#elif defined(CONFIG_UART1_SERIAL_CONSOLE)
#  define CONSOLE_DEV     g_uart2port
#  define TTYS0_DEV       g_uart2port
#  define TTYS1_DEV       g_uart0port
#else
#  error "No CONFIG_UARTn_SERIAL_CONSOLE Setting"
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: up_serialin
 ****************************************************************************/

static inline uint8_t up_serialin(struct up_dev_s *priv, int offset)
{
  return getreg8(priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_serialout
 ****************************************************************************/

static inline void up_serialout(struct up_dev_s *priv, int offset, uint8_t value)
{
  putreg8(value, priv->uartbase + offset);
}

/****************************************************************************
 * Name: up_disableuartint
 ****************************************************************************/

static inline void up_disableuartint(struct up_dev_s *priv, uint8_t * ier)
{
  if (ier)
    {
      *ier = priv->ier & IER_ALLIE;
    }

  priv->ier &= ~IER_ALLIE;
  up_serialout(priv, UART_IER_OFFSET, priv->ier);
}

/****************************************************************************
 * Name: up_restoreuartint
 ****************************************************************************/

static inline void up_restoreuartint(struct up_dev_s *priv, uint8_t ier)
{
  priv->ier |= ier & IER_ALLIE;
  up_serialout(priv, UART_IER_OFFSET, priv->ier);
}

/****************************************************************************
 * Name: up_waittxready
 ****************************************************************************/

static inline void up_waittxready(struct up_dev_s *priv)
{
  int tmp;

  /* Limit how long we will wait for the TX available condition */

  for (tmp = 1000; tmp > 0; tmp--)
    {
      /* Check if the tranmitter holding register (THR) is empty */

      if ((up_serialin(priv, UART_LSR_OFFSET) & LSR_THRE) != 0)
        {
          /* The THR is empty, return */

          break;
        }
    }
}

/****************************************************************************
 * Name: up_enablebreaks
 ****************************************************************************/

static inline void up_enablebreaks(struct up_dev_s *priv, bool enable)
{
  uint8_t lcr = up_serialin(priv, UART_LCR_OFFSET);
  if (enable)
    {
      lcr |= LCR_BREAK_ENABLE;
    }
  else
    {
      lcr &= ~LCR_BREAK_ENABLE;
    }
  up_serialout(priv, UART_LCR_OFFSET, lcr);
}

/****************************************************************************
 * Name: up_configbaud
 ****************************************************************************/
static inline void up_configbaud(struct up_dev_s *priv)
{

  /* In a buckled-up, embedded system, there is no reason to constantly
   * calculate the following.  The calculation can be skipped if the MULVAL,
   * DIVADDVAL, and DIVISOR values are provided in the configuration file.
   */

#ifndef CONFIG_UART_MULVAL
  uint32_t qtrclk;

  /* Test values calculated for every multiplier/divisor combination */

  uint32_t tdiv;
  uint32_t terr;
  int tmulval;
  int tdivaddval;

  /* Optimal multiplier/divider values */

  uint32_t div = 0;
  uint32_t err = 100000;
  int mulval = 1;
  int divaddval = 0;

  /* Baud is generated using FDR and DLL-DLM registers
   *
   *   baud = clock * (mulval/(mulval+divaddval) / (16 * div)
   *
   * Or
   *
   *   div = (clock/16) * (mulval/(mulval+divaddval) / baud
   *
   * Where mulval    = Fractional divider multiplier
   *       divaddval = Fractional divider pre-scale div
   *       div       = DLL-DLM divisor
   */

  /* Get UART block clock divided by 16 */

  qtrclk = U0_PCLK >> 4;        /* TODO: Different Uart port with different clocking */

  /* Try every valid multiplier, tmulval (or until a perfect match is found). */

  for (tmulval = 1; tmulval <= 15 && err > 0; tmulval++)
    {
      /* Try every valid pre-scale div, tdivaddval (or until a perfect match is 
       * found).
       */

      for (tdivaddval = 0; tdivaddval <= 15 && err > 0; tdivaddval++)
        {
          /* Calculate the divisor with these fractional divider settings */

          uint32_t tmp = (tmulval * qtrclk) / ((tmulval + tdivaddval));
          tdiv = (tmp + (priv->baud >> 1)) / priv->baud;

          /* Check if this candidate divisor is within a valid range */

          if (tdiv > 2 && tdiv < 0x10000)
            {
              /* Calculate the actual baud and the error */

              uint32_t actualbaud = tmp / tdiv;

              if (actualbaud <= priv->baud)
                {
                  terr = priv->baud - actualbaud;
                }
              else
                {
                  terr = actualbaud - priv->baud;
                }

              /* Is this the smallest error we have encountered? */

              if (terr < err)
                {
                  /* Yes, save these settings as the new, candidate optimal
                   * settings
                   */

                  mulval = tmulval;
                  divaddval = tdivaddval;
                  div = tdiv;
                  err = terr;
                }
            }
        }
    }

  /* Configure the MS and LS DLAB registers */

  up_serialout(priv, UART_DLM_OFFSET, div >> 8);
  up_serialout(priv, UART_DLL_OFFSET, div & 0xff);

  /* Configure the Fractional Divider Register (FDR) */

  up_serialout(priv, UART_FDR_OFFSET, ((mulval << 4) | divaddval));

#else

  /* Configure the MS and LS DLAB registers */
  up_serialout(priv, UART_DLM_OFFSET, DLMVAL >> 8);
  up_serialout(priv, UART_DLL_OFFSET, DLLVAL & 0xff);

  /* Configure the Fractional Divider Register (FDR) */

  up_serialout(priv, UART_FDR_OFFSET, ((MULVAL << 4) | DIVADDVAL));

#endif
}

/****************************************************************************
 * Name: up_setup
 *
 * Description:
 *   Configure the UART baud, bits, parity, fifos, etc. This
 *   method is called the first time that the serial port is
 *   opened.
 *
 ****************************************************************************/

