PX4/PX4-Autopilot/nuttx/arch/arm/src/lpc2378/lpc23xx_serial.c
static int up_setup(struct uart_dev_s *dev)
{
#ifndef CONFIG_SUPPRESS_LPC214X_UART_CONFIG
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  uint8_t lcr;

  /* Clear fifos */

  up_serialout(priv, UART_FCR_OFFSET, (FCR_RX_FIFO_RESET | FCR_TX_FIFO_RESET));

  /* Set trigger */

  up_serialout(priv, UART_FCR_OFFSET, (FCR_FIFO_ENABLE | FCR_FIFO_TRIG14));

  /* Set up the IER */

  priv->ier = up_serialin(priv, UART_IER_OFFSET);

  /* Set up the Line Control Register */

  lcr = 0;

  lcr |= (priv->bits == 7) ? LCR_CHAR_7 : LCR_CHAR_8;

  if (priv->stopbits2)
    {
      lcr |= LCR_STOP_2;
    }

  if (priv->parity == 1)
    {
      lcr |= LCR_PAR_ODD;
    }
  else if (priv->parity == 2)
    {
      lcr |= LCR_PAR_EVEN;
    }

  /* Enable access to latch divisor DLAB=1 */

  up_serialout(priv, UART_LCR_OFFSET, (lcr | LCR_DLAB_ENABLE));

  /* find values for DLL, DLM, DIVADDVAL, MULVAL */

  up_configbaud(priv);

  /* Disable access to latch divisor Clear DLAB */

  up_serialout(priv, UART_LCR_OFFSET, lcr);

  /* Configure the FIFOs */

  up_serialout(priv, UART_FCR_OFFSET,
               (FCR_FIFO_TRIG8 | FCR_TX_FIFO_RESET |
                FCR_RX_FIFO_RESET | FCR_FIFO_ENABLE));

  /* The NuttX serial driver waits for the first THRE interrrupt before sending 
   * serial data... However, it appears that the LPC2378 hardware too does not
   * generate that interrupt until a transition from not-empty to empty.  So,
   * the current kludge here is to send one NULL at startup to kick things off.
   */

  up_serialout(priv, UART_THR_OFFSET, '\0');
#endif
  return OK;
}

/****************************************************************************
 * Name: up_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void up_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  up_disableuartint(priv, NULL);
}

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method is
 *   called when the serial port is opened.  Normally, this is just after the
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless the
 *   hardware supports multiple levels of interrupt enabling).  The RX and TX
 *   interrupts are not enabled until the txint() and rxint() methods are called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  int ret;

  /* Attach and enable the IRQ */

  ret = irq_attach(priv->irq, up_interrupt);
  if (ret == OK)
    {
      /* Enable the interrupt (RX and TX interrupts are still disabled in the
       * UART */

      up_enable_irq(priv->irq);

      /* Set the uart interrupt priority (the default value is one) */
      if (priv->uartbase == UART0_BASE_ADDR)
        {
          up_prioritize_irq(priv->irq, PRIORITY_LOWEST);
        }
      else if (priv->uartbase == UART2_BASE_ADDR)
        {
          up_prioritize_irq(priv->irq, 10);
        }

    }
  return ret;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The exception is
 *   the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s *)dev->priv;
  up_disable_irq(priv->irq);
  irq_detach(priv->irq);
}

/****************************************************************************
 * Name: up_interrupt
 *
 * Description:
 *   This is the UART interrupt handler.  It will be invoked
 *   when an interrupt received on the 'irq'  It should call
 *   uart_transmitchars or uart_receivechar to perform the
 *   appropriate data transfers.  The interrupt handling logic\
 *   must be able to map the 'irq' number into the approprite
 *   uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int up_interrupt(int irq, void *context)
{
  struct uart_dev_s *dev = NULL;
  struct up_dev_s *priv;
  uint8_t status;
  int passes;

  if (g_uart0priv.irq == irq)
    {
      dev = &g_uart0port;
    }
  else if (g_uart2priv.irq == irq)
    {
      dev = &g_uart2port;
    }
  else
    {
      PANIC(OSERR_INTERNAL);
    }
  priv = (struct up_dev_s *)dev->priv;

  /* Loop until there are no characters to be transferred or, until we have
   * been looping for a long time. */

  for (passes = 0; passes < 256; passes++)
    {
      /* Get the current UART status and check for loop termination conditions */

      status = up_serialin(priv, UART_IIR_OFFSET);

      /* The NO INTERRUPT should be zero if there are pending interrupts */

      if ((status & IIR_NO_INT) != 0)
        {
          /* Break out of the loop when there is no longer a pending interrupt */

          break;
        }

      /* Handle the interrupt by its interrupt ID field */

      switch (status & IIR_MASK)
        {
          /* Handle incoming, receive bytes (with or without timeout) */

        case IIR_RDA_INT:
        case IIR_CTI_INT:
          {
            uart_recvchars(dev);
            break;
          }

          /* Handle outgoing, transmit bytes */

        case IIR_THRE_INT:
          {
            uart_xmitchars(dev);
            break;
          }

          /* Just clear modem status interrupts (UART1 only) */

        case IIR_MS_INT:
          {
            /* Read the modem status register (MSR) to clear */

            status = up_serialin(priv, UART_MSR_OFFSET);
            vdbg("MSR: %02x\n", status);
            break;
          }

          /* Just clear any line status interrupts */

        case IIR_RLS_INT:
          {
            /* Read the line status register (LSR) to clear */

